Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation
The mark tag text rotation values.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation.AlwaysRotate
Always rotate.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation.AlwaysHorizontal
Always horizontal.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation.DoNotRotateVertically
Do not rotate vertically.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation.AlwaysOrthogonal
Always orthogonal.